#include<stdio.h>
#include<string.h>

// int main()
// {
//     //写一段代码告诉我们当前的字节序是什么？
//     int a=1;
//     char* p=(char*)&a;
//     if(*p==1)
//     {
//         printf("小端模式\n");

//     }
//     else 
//          printf("大端模式\n");
//     return 0;
// }


//优化代码：
// int check_sys()
// {
//     int a=1;
//     char*p=(char*)&a;
//     if(*p==1)
//     {
//         return 1;
//     }
//     else
//     {
//         return 0;
//     }
// }

//优化：
// int check_sys()
// {
//     int a=1;
//     char* p =(char*)&a;
//     //返回1；小端
//     //返回0；大端
//     return *p;
// }

//优化Again：
// int check_sys()
// {
//     int a=1;
//     return *(char*)&a;
// }
// //指针类型的意义
// //1.指针类型决定了指针解引用操作符能访问几个字节：char*p,*p 访问了1个字节 ；int*p ,*p 访问4个字节
// //2.指针类型决定了指针+1 -1 ，加或者减的是几个字节；char*p ;p+1,跳过一个字符；int*p ;p+1,跳过一个整形-4个字节

// int main()
// {
//     int ret=check_sys();
//     if(ret==1)
//     {
//         printf("小端模式\n");
//     }
//     else
//     {
//         printf("大端模式\n");
//     }
//     return 0;
// }

//测试：输出什么？
// int main()
// {
//     char a=-1;
//     //10000000000000000000000000000001    原码  int 32个bit
//     //11111111111111111111111111111110    反码
//     //11111111111111111111111111111111    补码
//     //11111111   char 8个bit 
//     //11111111111111111111111111111111     打印的是%d整形  char类型要整形提升 
//     // char是有符号位   所以我们要符号位补1 最后得到的补码 然后 反码 得到原码 -1 所以还是-1
//     signed char b=-1;
//     //11111111
//     unsigned char c=-1;
//     //11111111  
//     //00000000000000000000000011111111  unsigned char 是无符号位 高位补0  
//     //得到上面的补码 无符号位 原码 反码 补码相同 
//     //它的原码也是上面的值  转换成10进制数是255
//     printf("a=%d,b=%d,c=%d",a,b,c); //-1 ，-1，255
// }

int main()
{
    char a=-128;
    //10000000000000000000000010000000
    //11111111111111111111111101111111
    //11111111111111111111111110000000 -补码
    //10000000
    //11111111111111111111111110000000 -整形提升 -补码
    //11111111111111111111111110000000 -无符号数 原码 补码 反码相同
    //4294967168
    printf("%u\n",a); //%u -打印十进制无符号数
    return 0;
}

//有符号位的char的范围是-128～127  127+1=-128  -1+1=0
//无符号位的char的范围是 0～255

int main()
{
    char a= 128;  //相当于127+1  ->-128
    printf("%u\n",a); //%u -打印十进制无符号数
    return 0;
}