#define  _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//for 的练习
//2.计算1！+2！+3！+....+10!

int main()
{
	int a = 0;
	int b = 0;
	int ret = 1;
	int sum = 0;
	for (a = 1;a <= 3;a++)
	{
		int ret = 1; //这里的ret进来的时候赋值为1，
		for (b = 1;b<=a;b++)  //每次进入for循环b都等于1开始
		{
			
			ret = ret * b;
		}//b的阶乘
		sum = sum + ret;
	}
	printf("%d\n", sum);
	return 0;
}

//思路：我们求1到 10 的阶乘，可以先求1到3 的阶乘先。首先给a和b=0 ret=1赋值，利用for循环赋值a为1 且1<3（a<=3)，条件成立进入循环
//里面又有一个for循环，先给b赋值1，则1 = 1 (a = b)时，条件成立进入循环，ret * b = 1 然后b++ = 2；2 > 1(b > a) 所以b <= a为假，跳出第二个for循环。
//sum = ret = 1 a++ = 2；第一个for循环又开始了;2 < 3（a <= 3)成立, 条件为真，则进入第二个for循环 且ret赋值为1，且b = 1  1 < 2(b < a), 条件成立，
//ret = 1 * 1 = 1； b++ = 2, 2 = 2(b = a), 条件成立，ret = 1 * 1 * 2 = 2; b++=2+1=3 ,3>2(b>a），条件不成立，跳出第二个for循环。sum = 2 + 1(上一个sum) = 3;
//a++ = 2 + 1 = 3, 3 = 3（a = 3) 条件成立，进入第一个for循环，b = 3, 3 = 3(a = b)条件成立，进入第二个for循环， ret = 1, b = 1; 1 < 3(b < a), 条件成立，
//ret = 1 * 1 = 1； b++ = 2, 2 < 3(b < a), 条件成立，ret = 1 * 1 * 2 = 2; b++=2+1=3 3=3(a+b)符合条件则ret =1*2*3=6 ,b++=3+!=4, 4>3(b>a)条件不成立，跳出第二个for循环，
//则sum=1+2+6=9
