#define CRT_SECURE_NO_WARNINGS


#include<stdio.h>

int main()
{
	double a = 5 /2.0;//商2余1   //取模%的两个操作数必须是整数。返回的是整除之后的余数
	printf("a=%lf\n", a);
	return 0;
}


int main()
{
	int a = 15;
	//>>  --右移操作符
	//移动的是二进制位
	//00000000000000000000000000001000   
	//右移操作符：1.算术右移  2.逻辑右移
	//算数右移：  右边丢弃，左边补原符号位
	//逻辑右移：  右边丢弃，左边补0   (右移1位有除2的效果)
	int b=a >> 1;
	printf("%d", b);
	return 0;
}


int main()
{
	int a = -1;
	//整数的二进制表示有：原码,反码，补码
	//存储到内存的是补码
	//10000000000000000000000000000001 - 原码  
	//11111111111111111111111111111110 - 反码
	//11111111111111111111111111111111 - 补码
	//
	int b = a >> 1;
	printf("%d", b);
	return 0;
}

int main()
{
	int a = 5;
	int b = a << 1;
	//00000000000000000000000000000101
	//00000000000000000000000000001010
	//左移操作符： 左边丢弃，右边补0   （左移1位有成2的效果）

	return 0;
}



int main()
{
	//& - 按2进制按位与
	int a = 3;
	int b = 5;
	int c = a & b;
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000001
	printf("%d", c);
	return 0;

}

int main()
{
	//| - 按2进制按位或
	int a = 3;
	int b = 5;
	int c = a | b;
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000111  7
	printf("%d", c);
	return 0;

}

int main()
{
	//^ - 按2进制按位异或
	//形同为0，相异为1
	int a = 3;
	int b = 5;
	int c = a ^ b;
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000110   6
	printf("%d", c);
	return 0;

}


int main()  //会溢出
{
	int a = 2;
	int b = 5;
	a = b + a;
	b = a - b;
	a = a - b;
	printf("%d%d", a, b);
	return 0;
}

int main()  //异或不会溢出
{
	int a = 3;
	int b = 5;
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("%d %d", a, b);
	return 0;
}